In [1]:
import pandas as pd
df = pd.read_csv('charges.csv')
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [2]:
df.shape

(1338, 7)

In [3]:
df.head(3)

   age     sex    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523
2   28    male  33.00         3     no  southeast   4449.4620

In [4]:
len(df['smoker'])

1338

In [5]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [6]:
df[['age', 'smoker']].max()

age        64
smoker    yes
dtype: object

In [7]:
df[df['age'] >= 60]

      age     sex     bmi  children smoker     region      charges
9      60  female  25.840         0     no  northwest  28923.13692
11     62  female  26.290         0    yes  southeast  27808.72510
20     60  female  36.005         0     no  northeast  13228.84695
26     63  female  23.085         0     no  northeast  14451.83515
33     63    male  28.310         0     no  northwest  13770.09790
...   ...     ...     ...       ...    ...        ...          ...
1301   62    male  30.875         3    yes  northwest  46718.16325
1321   62    male  26.695         0    yes  northeast  28101.33305
1322   62    male  38.830         0     no  southeast  12981.34570
1325   61    male  33.535         0     no  northeast  13143.33665
1337   61  female  29.070         0    yes  northwest  29141.36030

[114 rows x 7 columns]

In [8]:
df[df['smoker'] == 'yes'][df['age'] < 23].head(6)
#Here df['smoker'] == 'yes' is executed first. A better approach is written below

/tmp/ipykernel_3443/3904530608.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['smoker'] == 'yes'][df['age'] < 23].head(6)

     age     sex     bmi  children smoker     region      charges
0     19  female  27.900         0    yes  southwest  16884.92400
30    22    male  35.600         0    yes  southwest  35585.57600
57    18    male  31.680         2    yes  southeast  34303.16720
64    20  female  22.420         0    yes  northwest  14711.74380
82    22    male  37.620         1    yes  southeast  37165.16380
105   20    male  28.025         1    yes  northwest  17560.37975

In [9]:
df[(df['smoker'] == 'yes') & (df['age'] < 23)].max()
#Instead of traditional conditional 'and' and '&&' operator, here we only use '&'

age                 22
sex               male
bmi              52.58
children             4
smoker             yes
region       southwest
charges     44501.3982
dtype: object

In [10]:
df[(df['smoker'] == 'yes') & (df['age'] < 23)]['bmi'].max()

np.float64(52.58)

In [11]:
df[df['bmi'] == df[(df['age'] < 23) & (df['smoker'] == 'yes')]['bmi'].max()]

      age   sex    bmi  children smoker     region     charges
1047   22  male  52.58         1    yes  southeast  44501.3982

In [12]:
df[(df.index == 0) | (df.index == 3)]

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
3   33    male  22.705         0     no  northwest  21984.47061

In [13]:
df[df['charges'] == df['charges'].max()]

     age     sex    bmi  children smoker     region      charges
543   54  female  47.41         0    yes  southeast  63770.42801

In [14]:
for i in range(5):
    filtered_df = df[(df['charges'] > i * 2000)].head(2)
    print(filtered_df)
    print('-' * 63)

# Here print() function must be used to see the output

   age     sex    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523
---------------------------------------------------------------
   age     sex   bmi  children smoker     region    charges
0   19  female  27.9         0    yes  southwest  16884.924
2   28    male  33.0         3     no  southeast   4449.462
---------------------------------------------------------------
   age     sex   bmi  children smoker     region    charges
0   19  female  27.9         0    yes  southwest  16884.924
2   28    male  33.0         3     no  southeast   4449.462
---------------------------------------------------------------
   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
3   33    male  22.705         0     no  northwest  21984.47061
---------------------------------------------------------------
   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
3   33    male  22.705         0     no  northwest  21984.47061
---------------------------------------------------------------

In [15]:
data = ('Rahim', 'Student', 22)
df = pd.DataFrame(data)
df
# Here this df is only a single column or Series

         0
0    Rahim
1  Student
2       22

In [16]:
# Creating DataFrame from list of tuples
data = [('Rahim', 'Student', 22), ('Karim', 'Student', 23), ('Rajib', 'Plumber', 26)]
df = pd.DataFrame(data, columns = ('Name', 'Occupation', 'Age'))
df

    Name Occupation  Age
0  Rahim    Student   22
1  Karim    Student   23
2  Rajib    Plumber   26

In [17]:
# Creating DataFrame from list of dictionaries
dict_list = [ {'Name' : 'Abul', 'Age' : 22}, {'Name' : 'Hayat', 'Age' : 22},  {'Name' : 'Soikot', 'Age' : 22, 'Occupation' : 'Unemployed'} ]
df = pd.DataFrame(dict_list)
df

     Name  Age  Occupation
0    Abul   22         NaN
1   Hayat   22         NaN
2  Soikot   22  Unemployed

In [18]:
# # Creating DataFrame from Excel file
df = pd.read_excel("Book1.xlsx", "Sheet1")
df

    Name  Age  Occupation     Status
0  Rahim   22       Bekar      Alive
1  Karim   23  Freelancer  Half-dead
2  Bantu   30   Corp. JOB       Dead

In [19]:
df = pd.read_csv('stock_data.csv')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [20]:
# In case of a csv file with missing headers
df = pd.read_csv('stock_data.csv', header=None, names=['First', 'Second', 'Third', 'Fourth', 'Fifth'])
df

     First         Second    Third Fourth          Fifth
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [21]:
df = pd.read_csv('stock_data.csv', na_values = ['not available', 'n.a.'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [22]:
# Cleaning useless or Invalid data
df = pd.read_csv('stock_data.csv', na_values = {
    'revenue' : ['not available', 'n.a.', -1],
    'eps' : ['not available', 'n.a.'],
    'price' : ['not available', 'n.a.'],
    'people' : ['not available', 'n.a.']
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [23]:
df.to_csv('stock_data2.csv', index=False)
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [24]:
df.to_csv('stock_data2.csv', index=False, columns = ['tickers', 'revenue','price'])

In [25]:
not_allowed = ['n.a.', 'not available']

def convert_people(cell):
    if cell in not_allowed:
        return 'Sam Altman'
    return cell
    
def convert_eps(cell):
    if cell in not_allowed:
        return None
    return cell
    
df = pd.read_excel('stock_data.xlsx', 'Sheet1', converters = {
    'people' : convert_people, 'eps' : convert_eps
     })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     Sam Altman
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [26]:
df.to_excel('stock3.xlsx', sheet_name='stocks', index=False)

In [27]:
df = pd.read_csv('weather_data.csv')
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [28]:
new_df = df.fillna({
    'temperature' : 0, 'windspeed' : 0, 'event' : 'No Event'
})
new_df

         day  temperature  windspeed     event
0   1/1/2017         32.0        6.0      Rain
1   1/4/2017          0.0        9.0     Sunny
2   1/5/2017         28.0        0.0      Snow
3   1/6/2017          0.0        7.0  No Event
4   1/7/2017         32.0        0.0      Rain
5   1/8/2017          0.0        0.0     Sunny
6   1/9/2017          0.0        0.0  No Event
7  1/10/2017         34.0        8.0    Cloudy
8  1/11/2017         40.0       12.0     Sunny

In [29]:
new_df = df.ffill() # Forward Fill missing values
new_df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         32.0        9.0   Sunny
2   1/5/2017         28.0        9.0    Snow
3   1/6/2017         28.0        7.0    Snow
4   1/7/2017         32.0        7.0    Rain
5   1/8/2017         32.0        7.0   Sunny
6   1/9/2017         32.0        7.0   Sunny
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [30]:
new_df = df.interpolate() # Guess the mising values
print(type(df.temperature[0]))
new_df

<class 'numpy.float64'>

/tmp/ipykernel_3443/3212918309.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  new_df = df.interpolate() # Guess the mising values

         day  temperature  windspeed   event
0   1/1/2017    32.000000       6.00    Rain
1   1/4/2017    30.000000       9.00   Sunny
2   1/5/2017    28.000000       8.00    Snow
3   1/6/2017    30.000000       7.00     NaN
4   1/7/2017    32.000000       7.25    Rain
5   1/8/2017    32.666667       7.50   Sunny
6   1/9/2017    33.333333       7.75     NaN
7  1/10/2017    34.000000       8.00  Cloudy
8  1/11/2017    40.000000      12.00   Sunny

In [31]:
df = pd.read_csv('weather_data.csv', parse_dates=['day'])
df.set_index('day', inplace=True)
df = df.infer_objects(copy=False) # Infer objects to their most likely types
new_df = df.interpolate(method='time')
new_df

/tmp/ipykernel_3443/835494440.py:4: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  new_df = df.interpolate(method='time')

            temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    29.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny

In [32]:
new_df = df.dropna()
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny